[{"date": "March 11, 2021", "title": "Palace: No need for lockdown – The Manila Times", "full article": "\nThere is no need for the country to be placed under lockdown even if Covid-19 cases are rising, Malacañang said on Wednesday.\nNOT TOO CLOSE Members of the Manila Police District remind pedestrians to observe physical distancing on March 10, 2021as law enforcers tightened the enforcement of health protocols to stop the further spread of Covid-19. PHOTO BY MIKE ALQUINTO\nPalace spokesman Harry Roque Jr. said there was no reason to close businesses again. He added that hospital capacity remained adequate.\n“Ang babantayan po talaga natin, iyong kapasidad natin na magbigay ng medikal na atensyon doon sa mga seryosong magkakasakit. Kapag naubusan po tayo ng ICU beds, ng isolation beds, ng mga magbabago ng klasipikasyon (If we don’t have enough ICU beds, then that’s the time we will change our quarantine classifications),” Roque said in an interview with state-run Radyo Pilipinas on Tuesday.\nOf 1,900 ICU or intensive care unit beds, Roque said 60 percent were still available while 65 percent of 13,500 isolation beds remained unoccupied.\nHe added that 75 percent of 6,000 ward beds were available.\n“So, sa tingin ko po bagamat marami ang nagkakasakit inaasahan natin na 2 to 3 percent lang ang maoospital at sapat-sapat pa po ang ating mga kama para sa mga magkakasakit (So, even if there is a surge in Covid-19 cases, we expect at least 2 to 3 percent of them will be hospitalized, and we have enough hospital beds for those who will get sick),” Roque said.\n“At wala pong dahilan para isarado natin muli ang ekonomiya dahil kapag isinarado po natin ang ekonomiya mas marami pong nagugutom (There is no reason for us to shut down our economy because if we shut it down, more people will go hungry),” he added.\nThe Palace official said local government units could impose localized or granular lockdowns in areas where there was a surge in Covid-19 cases.\n“Dahil sa totoo lang po, hindi na po natin kaya na mag-lockdown ng ating ekonomiya. Napakadami na pong nagugutom (To be honest, our economy can’t afford another lockdown. Many are hungry),” he added.\nOn Monday, the number of new Covid-19 cases exceeded the 3,000-mark for the fourth consecutive day, bringing the total of cases to more than 597,000.\nThe Octa Research team earlier warned that the Philippines might see 5,000 to 6,000 new Covid-19 cases per day by the end of March.\nPresident Rodrigo Duterte on Monday reminded the public to strictly observe minimum health protocols to curb the transmission of Covid-19.", "author": "Catherine S. Valente, TMT"}]